#- Комментарий
print("Hello world")          #- переменная с параметром
#**- Возведение в степень
#%- Деление по модулю
#//- Чилочисленное деление с отбрасыванием дробной части
#/- Деление *-Умножение -Вычитание +Сложение
print(23 % 7)
print(23 // 7)
# int() целочисленный тип данных, целые числа
# "" -str() строки
#  float, - вещественные числа, с плаващей точкой
My_name = "Danil "
My_friend = "Бони"
My_number = 777
print(My_name + " " + My_friend)
print(My_name + " 777 ")
print(My_name + " " + str(My_number))
# f{} - функция интерполяции (переменная)
print(f"{My_name} любимое число {My_number}")
print(My_name * 5)
# Переменная- это область памяти компьютера, в которой может храниться одиночное значение, знак = является оператором присваивания и сохраняет значаения
color =  "red"
print(color)