#- Комментарий
print("Hello world")          #- переменная с параметром
#**- Возведение в степень
#%- Деление по модулю
#//- Чилочисленное деление с отбрасыванием дробной части
#/- Деление *-Умножение -Вычитание +Сложение
print(23 % 7)
print(23 // 7)
# int() целочисленный тип данных, целые числа
# "" -str() строки
#  float, - вещественные числа, с плаващей точкой
My_name = "Danil "
My_friend = "Бони"
My_number = 777
print(My_name + " " + My_friend)
print(My_name + " 777 ")
print(My_name + " " + str(My_number))
# f{} - функция интерполяции (переменная)
print(f"{My_name} любимое число {My_number}")
print(My_name * 5)
# Переменная- это область памяти компьютера, в которой может храниться одиночное значение, знак = является оператором присваивания и сохраняет значаения
color =  "red"
print(color)
# Имя переменной должно представлять собой одно слово без пробелов, в имени переменной могут использоваться только буквы, цифры, символы подчеркивания
# Имя переменной не может начинаться с цифры
_ = "my little war"
print(_)
# Переменные нельзя называть с пробела, цифры, спец символа
print(len(My_name))
# My_name = int(input("Ввод"))
My_name1 = float(input("Ввод"))
# print("Привет! " + My_name)
print(5 + My_name1)
# Все что введешь input будет строка
# Конкатенация это сложение/склеивание строк
# Репликация это умножение разных типов данных